WebService-ModbusMaster/Source/Gsoap/inc/modbus.mb-master-consulta.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:modbus">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:mb-master-consulta>
   <pregunta>
    <ID-escalvo>0</ID-escalvo>
    <funcion>0</funcion>
    <datos SOAP-ENC:arrayType="xsd:unsignedByte[1]">
     <item>0</item>
    </datos>
   </pregunta>
  </ns:mb-master-consulta>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
